ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_NUC472/device/StdDriver/nuc472_emac.c
    // Get Next Frame Descriptor pointer to process
    desc = (EMAC_DESCRIPTOR_T *)desc->u32Next;

    // Save last processed Rx descriptor
    u32CurrentRxDesc = (uint32_t)desc;

    EMAC_TRIGGER_RX();
}

// Transmit functions

/**
  * @brief Send an Ethernet packet
  * @param[in] pu8Data Pointer to a buffer holds the packet to transmit
  * @param[in] u32Size Packet size (without 4 byte CRC).
  * @return Packet transmit success or not
  * @retval 0 Transmit failed due to descriptor unavailable.
  * @retval 1 Packet is copied to descriptor and triggered to transmit.
  * @note Return 1 doesn't guarantee the packet will be sent and received successfully.
  */
uint32_t EMAC_SendPkt(uint8_t *pu8Data, uint32_t u32Size)
{
    EMAC_DESCRIPTOR_T *desc;
    uint32_t status;

    // Get Tx frame descriptor & data pointer
    desc = (EMAC_DESCRIPTOR_T *)u32NextTxDesc;

    status = desc->u32Status1;

    // Check descriptor ownership
    if ((status & EMAC_DESC_OWN_EMAC)) {
        return (0);
    }

    memcpy((uint8_t *)desc->u32Data, pu8Data, u32Size);

    // Set Tx descriptor transmit byte count
    desc->u32Status2 = u32Size;

    // Change descriptor ownership to EMAC
    desc->u32Status1 |= EMAC_DESC_OWN_EMAC;

    // Get next Tx descriptor
    u32NextTxDesc = (uint32_t)(desc->u32Next);

    // Trigger EMAC to send the packet
    EMAC_TRIGGER_TX();

    return (1);
}


/**
  * @brief Clean up process after packet(s) are sent
  * @param None
  * @return Number of packet sent between two function calls
  * @details EMAC Tx interrupt service routine \b must call this API or \ref EMAC_SendPktDoneTS to
  *          release the resource use by transmit process
  */
uint32_t EMAC_SendPktDone(void)
{
    EMAC_DESCRIPTOR_T *desc;
    uint32_t status, reg;
    uint32_t last_tx_desc;
    uint32_t u32Count = 0;

    reg = EMAC->INTSTS;
    // Clear Tx interrupt flags
    EMAC->INTSTS = reg & (0xFFFF0000 & ~EMAC_INTSTS_TSALMIF_Msk);


    if (reg & EMAC_INTSTS_TXBEIF_Msk) {
        // Bus error occurred, this is usually a bad sign about software bug and will occur again...
        printf("TX bus error\n");
    } else {
        // Process the descriptor(s).
        last_tx_desc = EMAC->CTXDSA ;
        // Get our first descriptor to process
        desc = (EMAC_DESCRIPTOR_T *) u32CurrentTxDesc;
        do {
            // Descriptor ownership is still EMAC, so this packet haven't been send.
            if (desc->u32Status1 & EMAC_DESC_OWN_EMAC) {
                break;
            }
            // Get Tx status stored in descriptor
            status = desc->u32Status2 >> 16;
            if (status & EMAC_TXFD_TXCP) {
                u32Count++;
            } else {
                // Do nothing here on error.
                if (status & EMAC_TXFD_TXABT) {;}
                if (status & EMAC_TXFD_DEF) {;}
                if (status & EMAC_TXFD_PAU) {;}
                if (status & EMAC_TXFD_EXDEF) {;}
                if (status & EMAC_TXFD_NCS) {;}
                if (status & EMAC_TXFD_SQE) {;}
                if (status & EMAC_TXFD_LC) {;}
                if (status & EMAC_TXFD_TXHA) {;}
            }

            // restore descriptor link list and data pointer they will be overwrite if time stamp enabled
            desc->u32Data = desc->u32Backup1;
            desc->u32Next = desc->u32Backup2;
            // go to next descriptor in link
            desc = (EMAC_DESCRIPTOR_T *)desc->u32Next;
        } while (last_tx_desc != (uint32_t)desc);    // If we reach last sent Tx descriptor, leave the loop
        // Save last processed Tx descriptor
        u32CurrentTxDesc = (uint32_t)desc;
    }
    return (u32Count);
}

/**
  * @brief Clean up process after a packet is sent, and get the time stamp while packet is sent
  * @param[in]  pu32Sec Second value while packet sent
  * @param[in]  pu32Nsec Nano second value while packet sent
  * @return If a packet sent successfully
  * @retval 0 No packet sent successfully, and the value in *pu32Sec and *pu32Nsec are meaningless
  * @retval 1 A packet sent successfully, and the value in *pu32Sec and *pu32Nsec is the time stamp while packet sent
  * @details EMAC Tx interrupt service routine \b must call this API or \ref EMAC_SendPktDone to
  *          release the resource use by transmit process
  */
uint32_t EMAC_SendPktDoneTS(uint32_t *pu32Sec, uint32_t *pu32Nsec)
{

    EMAC_DESCRIPTOR_T *desc;
    uint32_t status, reg;
    uint32_t u32Count = 0;

    reg = EMAC->INTSTS;
    // Clear Tx interrupt flags
    EMAC->INTSTS = reg & (0xFFFF0000 & ~EMAC_INTSTS_TSALMIF_Msk);


    if (reg & EMAC_INTSTS_TXBEIF_Msk) {
        // Bus error occurred, this is usually a bad sign about software bug and will occur again...
        printf("TX bus error\n");
    } else {
        // Process the descriptor.
        // Get our first descriptor to process
        desc = (EMAC_DESCRIPTOR_T *) u32CurrentTxDesc;

        // Descriptor ownership is still EMAC, so this packet haven't been send.
        if (desc->u32Status1 & EMAC_DESC_OWN_EMAC) {
            return (0);
        }
        // Get Tx status stored in descriptor
        status = desc->u32Status2 >> 16;
        if (status & EMAC_TXFD_TXCP) {
            u32Count = 1;
            *pu32Sec = desc->u32Next; // second stores in descriptor's NEXT field
            *pu32Nsec = EMAC_Subsec2Nsec(desc->u32Data); // Sub nano second store in DATA field
        } else {
            // Do nothing here on error.
            if (status & EMAC_TXFD_TXABT) {;}
            if (status & EMAC_TXFD_DEF) {;}
            if (status & EMAC_TXFD_PAU) {;}
            if (status & EMAC_TXFD_EXDEF) {;}
            if (status & EMAC_TXFD_NCS) {;}
            if (status & EMAC_TXFD_SQE) {;}
            if (status & EMAC_TXFD_LC) {;}
            if (status & EMAC_TXFD_TXHA) {;}
        }

        // restore descriptor link list and data pointer they will be overwrite if time stamp enabled
        desc->u32Data = desc->u32Backup1;
        desc->u32Next = desc->u32Backup2;
        // go to next descriptor in link
        desc = (EMAC_DESCRIPTOR_T *)desc->u32Next;

